//1

let tempC = +prompt("Введите температуру в градусах Цельсия", 0)
let tempF = (9 / 5) * tempC + 32
alert(tempC + " градусов по Цельсию = " + tempF + " градусов по Фаренгейту")

//2

let admin
let name

name = "Василий"
admin = name

console.log(admin)

//3

Чему будет равно JS-выражение 1000 + "108"  // 1000108

//4

Атрибут async
Async используется для того, чтобы указать браузеру, что скрипт может быть выполнен асинхронно.
Парсеру HTML нет необходимости останавливаться, когда он достигает тега <script> для загрузки 
и выполнения. Выполнение может произойти после того, как скрипт будет получен параллельно с разбором документа.


Атрибут defer
Атрибут defer указывает браузеру, что скрипт должен быть выполнен после того,
как HTML-документ будет полностью разобран.

